In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    "first": ["Bayardo", "Josue", np.nan, None, 'NA', None],
    "last": ["Lopez", "Salazar", np.nan, np.nan, 'Missing', np.nan],
    "email": ["bjlslopez@gmail.com", "bjlopezs@hotmail.com", None, None, 'Missing', 'Anonymous@email.com'],
    "age": ['24', '24', None, None, 'Missing', None]
}

In [3]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [4]:
df

     first     last                 email   age
0  Bayardo    Lopez   bjlslopez@gmail.com    24
1    Josue  Salazar  bjlopezs@hotmail.com    24
2      NaN      NaN                  None  None
3     None      NaN                  None  None
4      NaN      NaN                   NaN   NaN
5     None      NaN   Anonymous@email.com  None

In [5]:
df.dropna()

     first     last                 email age
0  Bayardo    Lopez   bjlslopez@gmail.com  24
1    Josue  Salazar  bjlopezs@hotmail.com  24

In [6]:
df.dropna(axis='index', how='all')

     first     last                 email   age
0  Bayardo    Lopez   bjlslopez@gmail.com    24
1    Josue  Salazar  bjlopezs@hotmail.com    24
5     None      NaN   Anonymous@email.com  None

In [7]:
df.dropna(axis='columns', how='all')

     first     last                 email   age
0  Bayardo    Lopez   bjlslopez@gmail.com    24
1    Josue  Salazar  bjlopezs@hotmail.com    24
2      NaN      NaN                  None  None
3     None      NaN                  None  None
4      NaN      NaN                   NaN   NaN
5     None      NaN   Anonymous@email.com  None

In [8]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

     first     last                 email   age
0  Bayardo    Lopez   bjlslopez@gmail.com    24
1    Josue  Salazar  bjlopezs@hotmail.com    24
5     None      NaN   Anonymous@email.com  None

In [9]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2   True   True   True   True
3   True   True   True   True
4   True   True   True   True
5   True   True  False   True

In [10]:
df.fillna('MISSING')

     first     last                 email      age
0  Bayardo    Lopez   bjlslopez@gmail.com       24
1    Josue  Salazar  bjlopezs@hotmail.com       24
2  MISSING  MISSING               MISSING  MISSING
3  MISSING  MISSING               MISSING  MISSING
4  MISSING  MISSING               MISSING  MISSING
5  MISSING  MISSING   Anonymous@email.com  MISSING

In [13]:
df['age'] = df['age'].astype(float)

In [15]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [16]:
df['age'].mean()

24.0